using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Winforms
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
            Something.MouseEnter += (o, e) => changeColor(Color.Red);
            Something.MouseLeave += (o, e) => changeColor(Color.Blue);
        }

        public void changeColor(Color ThatOneColor)
        {
            Something.BackColor = ThatOneColor;
        }

        private void button1_Click(object sender, EventArgs e)
        {
            if (Failsafe.Checked && DateTimePicker.Value <= DateTime.Now)
            {
                Environment.Exit(0);
            }
        }

        private void checkBox1_CheckedChanged(object sender, EventArgs e)
        {
            if (Failsafe.Checked)
            {
                Something.Text = "Y̵̨̛͚̺̝͍̗͎͈̦͉͎̥̭̤̞̙̬̫̹̬̪̜̙͔͎͉͂͊͂̈́͐̀̋̋̍̀͂̑̿̏̀̍͌̂̓̈̑̈̈̽̔̀̕̚ͅͅo̸̧̧̢̝͓̳̱̦̯̥͕͚͎̜̣̥̟̰̻͉̭͚͚̣̤͖̦̾̇̃̀̋̈́̂̈́̈́͒͒̓̄̅̽͑̓̎̈́̚̚͜͠͝͝͠͝͝͠͠ư̷̛̗̱͓͇̘̙͔͉̤͙̻͖̥̥̙͔̤͕̻̪̣͔̳̝̣̘̼̇̈́͊̽͂̎͛̐̀̀̆̈́̔̾̔͑́͐̅͆̾͒̂̚͘̚͜͝ͅ ̷̧̨̛̛̖̙̩͚̝̺̱̪̖̣̜̭̗̬̫̤̭̗̪͕̻͔̲͓̳̈̃̅̌̔́̒̈́̓͌̒̈̉͛̍̊̇͋͂͋͑̑̍͑͘̕͜͝ͅp̸̢̢̡͓͍͓̥͕̳̭̠̰͈̙̙̣͇̹̙̠͇͙͉̦͓̣͊̀͐̎̑̐̊͆̌̓̔̂̑̃̍̀̅̋̿̈́̔̈́̂͑͌̿̐͘̕͜͜͜ŗ̸̡͓̺͉̲̠̺̱͖̲̥̫̩͕͓͍͕̭̦̥͎̣̳̣̤̣͉̑́̄̇̔̿̀̑̎͒́͌̇̔̐̀̅̆̎̒̄̌̈́̕̕̕͜͝͝͝é̵̢̧̢̧̛̛̛̮͕̝̱̞̺̳͉̣̫͎͎̗̞̻̤͓̦̹̩͓͍̣̯͋͑̐̏̑̑̅̆͆͗͂̃͌̉͒̔͋͒̊̈̇̍̓̀͘ͅs̵̨͖̰̦͓̯͔̩̜̝̬͖̟͔̦̗͉͔̘̩̹̩̟̯̠̭͒̾̓̅̓͆͒̋̂̋́̄̓̎̈́̿̓͑͛̆̋͗̐̆͌̃̕͜͜͜͝͝s̷̡̛̱͔̥͖̰͇̘͉̬̦̬̤̭̲̭͕̦͉͖͎͓͇̬̬̣̱̃͊̅̍͋̅͋̏̈̋̃̊͊͒͌̈̽̓́͂̿̕̚͜͝͝͝͝͝ͅȩ̴̧̨̨̡̡̡̛̻̜̟̰̥̮̹̻̬̫̻̬͍͎̦̳̟̤͎̙̤̳̅̀̄́͒̀̉̌̂̐͊̎̈́̅̃̌̔̅̓́͛̎̚͝͝͝͠͝d̶̦̼͔̻̘̹͓̞̼͕̥̼͚̩̺͎̹̖̪̹̭̙̱͓͇̳̮́̑̒̊̒̅͐̃͊͂͆̌̈́̅̈́̾͑͌̀͒̂͐͘̕̚̚̚͜͠ ̶̛̠̪̯̘̩̙̞̲̩̙͖̺͍̣͎̭͎̤͇̦̖̬̳̞̖̦̥̟̱̀́̒̏̈́̎̿̅̓̐̾͋̑̄͊͆̆̔̈́͆͘̕͝͝͝͝͠t̵̛̛̹̝̲̝̬̺͍̩̹̲̬̰̗̗̹̱̣͖̥̖͇̥̬̭̯͓̍̏̀̎͐͛̔͑͋̎̔̃̂̈̓̃̏̎̿̎͆̇̕͘̕͜͠͝ͅͅḣ̸̡̲͉̩̺̥̞̗͚͎͔̝̠͍̺̜̳̠̣̺͖͎̼̝͚̬̅͆͒͆̿̀̂́͗͂̀̋̐͌̄̿̈̍́̒̉̽͑̅͘̕͘͝ͅͅͅę̵̢̨̛̛͔̥͈̹̩̜͍͙͓͉̝͎̞̙͙̩̰̭̼̣̰̪͙̺͚͆͐̋̿̆͑͛̏̓̈́̓̐̆̓̔͒͊̃̑̀̆̈͘̚͝͝͝ͅ ̸̡̡̡̛̘̫̞͖͚̮̮͕͚͙̗̩̟̗̥̮̗̰̩̳̜͈̝̖̜̲́͛̀̏́̐̃͐̅̃̅́͆̉̽̍̽̇̈́͌͊͐̉̊͛͘͝͠f̵̨̨̧̡̛̠̼̰̰͕̲͈͍̗̻̥̘̺͈̜̞̟͚̲͕̥̘̻͂̈͂͆̓̑̎̂̾͐̀̽͌̀̇̃͆̌̾̌͑̌̈̄͜͠͝͠͝ͅả̶̡̡͓̱̗͙̠̻̩̟͕̞̜͖̦̙̙͍͖̺͇͚̻͍̺̻̗́̅̂͂͗͒́̌́̓̇͒͌̓̇̽͐̆̄͆͒͘͠͝͝͝͝͠ͅi̷̢̡̨̙͉̙̭͕͖̻̪͎̮͚̮̖̣̼͖͈̱͈̠̲͎̗̙̝̮̅͛̔͑̓̽͗͋̿̈̈́͒̏͛̅͗͛̀́̀̿͗̈́̒̅̾͘͝l̵͈̟̲̼͎̲͈̫̣͙̘͖͇̳͎̙͚̥̦̦̲̜̱̩͉͍̥̼̱͋̊̏̀̓̅͒͂͆́̃̀̂̓̈́̆̍̔͐̍̽̿͗̕̚͝͠͝͝ş̷̢̡̤̮͇̫͚̼̠͎͙͓̗̜͙̯͙͔̫͖̙͉̳͈̬͍̱̀̅̈́̇̏͊͒̑̃̐̽͊͊̌̒͗͂̍̋͑͗͛̎͘͜͠͠͝͠͝a̴̧͔͉͙̙̺̻̫̳͙͓̰͍̺̲̻̞̻̦̰̖͖̩̮̹͙͇̽̏̀̍͑̓͂̔̌͌́͋̿̂̇̄̽́͐͗͊̾̑̿̊͋͗̆̕͜͜f̵̡̡̨̡̫͇͍̟̲͚̼̱̖͔̜̜͉͎̼͙͚͍̭̫̗̹͚͖̻̈́̀̋̆̇̈͑̈́̿̏͛̅̿̓͆̔́̂̔̈̀̀͒̑̈́̈͘̕͝e̶̡̧̧̛̛̛͓̩̩̥̬͓̻̦͇̰̹̙̰͍̖̖̹͈̪̘̘̟̯͖̯͎͂̐̓̒̃̃̓̌̆́͑͒̎̿̊͊̏̉̑̈́̐̕̚͝͝͠.̵̢̧̡̛̛̦̦̙̰̲͈̤̰̹̥͕͇̼̺͍͇̰͈̼̬̪͓̩̯͈̯̃́̇̓͋̒́̉̈́̒͗́͛̈́͊͒̏́̑͊͒̄̍͑̚͠ ̵̢̛̳̘̳͙̣̥̤͚̞̺͈͉̟̼͍̯̭̲̗͉̬̳̱̮̻̭͕̀̄͛̾́́̊̄̌͗̈́͋̾͂̏̏̉̒̏̓̿̃̎͋̚͜͝͝͠Y̶̨̡̡̧̨̢̛̯̭̜̪̫̖̘͉̘̙̩̩͎͙̹̘͚͔͙̞̙̹̍̏͒̈́̐̍̋̀̇͂̃͂̌͛̃̓̋̓̽̿̈́̓̾̕̕͜͠͝͠ơ̸̢̧̧͎̙͈̬̦͇̝̗̻͕̖̳̬̝͚̼̗͙͍̺̦̹̱̑̄́̊͊̄̑̎̏͊̽̋̅͋̈̾́̋̈́͂͒̃̐̍͂͘͜͜͠ͅư̵̢̢͖̞̭͔̗̣͈͍͇͔̺͍̭̯̖͓̘̯̘̺̣͚͎̯͆͊̋̓̍͒͒̃̆̆͗̈́̈́̏̌̊̄̾̀̾͂̈̾̐̐̃͜͜͝͝ͅ ̷̡̪̼̱͕̬͕̠̩̼̩̼̗̲̪̣̞̖̜͙̹̲̞̤̟̖͓͉̋̾͆̈̾̊̌͊̌̿̓̓͌́͐̇̄̀̓͆̌́́͋͌͘̚͠͝ͅẉ̸̡̡̡͖̮͉͚̘͖̦̭̯̲͖̩͍̭͙͇̯̗̘͚̩̦͍̹̬̎́́̽̆̉̓͊̐̍̐̆͒̄̓͋͊̋͂͊̾͋̐́̓̚͘̕͝í̵̡̧̢̥̰͙̭̰̬̭̩̝̻͕̰͎̦̪̖̫͎̙͚͈͕̮̱̔̐̇̌̃͑̿̄͆̍̂̿̀͊̀͐͐̀̒̍͗͒̕͜͝͝͝͠͝ͅl̶̡̢̙̲̩͓̭͙̻͔̹̞̫̝̯͓͓͙̺̤͎̩̭̼͔̣̏͆̇̒̋̑̓̒͊̃́͆̍̏̌͗̿̇͊͛͗̔̈̚͘͘͘͘̕͜ͅl̴̢̛͇͍̰͓͚̬͎̠̞͖̻̲̻̺͚̯̮̞̻͚̗̺̻͓͖̦̉̊͌̆̿͊̓͗̿̓̃̓̎́̒̽̽͌̈́̃̎̾̆̒̉̊͘͘͜ͅ ̶̨̧̨̨̧̛͎̜̦̪̹̞̝̜̟̥̩͈̮̙̖͉̠̮̫̘̙̼̰̮́̌̈́͐̃̅͌́̽͋̒͋̃̐̐͐͂̅̑͐̃̆̂́̕͘͘͠ḍ̸̨̰̱̜̝̳̥͈͚̳͎͕̮̗̰̳̠̳͎̞̜̪͕̤̺̞̽̀̂̆̆̐̆̍͆͛̈̊͗͂̏̇́̈́͂̓̂̏̍̄̽̈́͘͘͝ͅͅi̶̡̡̨͙̤͓̩͚̖̳͙͙̤̻̟̩̹̯͍̮̥̲̤͉̟̝̺̍͛͂̓̄̀̿͂́̒̎̍͋̀͗̌̍̈́̀̈͋͑̈́̐̚͜͜͝͠͠͠ȩ̶͔̺̝̦̲̯͈̭̙̖͖͎͓̗̜̯͖̳̼͈͔̭̯̙̝͕͉̞̾̊͗̈͑͗́͗͆̉̈̆̈̉́̐́̇̏̃̈̄̾̒͐͑̽̓̚ ̶̨̧̡̢̘̝͖͉̗̼̣͓̞̟̰͔̼̟̼̺͉̪͓̩͓͖̎̾̏̄͒̏̃͗̉̂͋̽̎̓̓͗̅̄͌̈́̐͆͊̐̿̚͘̕͝ͅͅͅn̶̡̨̡̨̧̝̬̮̜̰͚͓̙͈̟̣̰̮͙̣͔̣̤̲͕̙͉͎̜̓́̐́̀͗̏̑̏̃͒̈́̀̄͑̈́̈́͆́͆́̐̍͋͆̌̚̕͝ǫ̴̢̨̛̛̮̫̘̺̺̼̪̞̯͎͔̹̬͙̖͓̙̬̙̰̝̳̞̝̘̇͂͊̀̾̋̂̅̽̒̅̇͆̓̉͆͗̐͊̈̅͌̒̓̚͘͝ͅw̵̡̢̼̖̝̖̤̫̬̠̺̞̱̞̪̮̻̦̮̫̖͉̫̤̺̼̮̙̖̆̒̅̀͗͑̆̅͌͒̈́̍̏̒̽̂̎̈́̆͐̊͒̀̆̆̾̓͑̽.̵̨̨̛̛̲̮̲̞̞͖̺͎͉͕͇̮̭͙̥̥̝̮̝͉̣̮̯̫̲͇̆̿̾͂̎͋͊́̄͂͗̈́̒̐́͗̓͑̏͛̆̓͗̆̈́̉͜͝";
            }
        }

        private void DateTimePicker_ValueChanged(object sender, EventArgs e)
        {

        }

        private void textBox1_TextChanged(object sender, EventArgs e)
        {
            if(textBox1.Text == "Quit Program")
            {
                Environment.Exit(0);
            }
        }

        private void label1_Click(object sender, EventArgs e)
        {
            ThatOneLabel.Text == "This is a label. Cool.";
        }
    }
}
